{
    "class_name": "Sequential",
    "config": {
        "name": "sequential_10",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        784
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "dense_30_input"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_30",
                    "trainable": true,
                    "dtype": "float32",
                    "batch_input_shape": [
                        null,
                        784
                    ],
                    "units": 199,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L1",
                        "config": {
                            "l1": 0.0
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_30",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_31",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 0,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L1",
                        "config": {
                            "l1": 0.0
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_31",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_32",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 10,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L1",
                        "config": {
                            "l1": 0.0
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_32",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "softmax"
                }
            }
        ]
    },
    "keras_version": "2.13.1",
    "backend": "tensorflow"
}